src/cf/Documents/bon_ВыводИзОборотаНоминальныхОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>bon_ВыводИзОборотаНоминальныхОбъектов</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.bon_СостоянияНоминальныхОбъектов</xr:Item>
				<xr:Item>AccumulationRegister.bon_ПартииБонусовНаСчетах</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНоминальныхОбъектов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.bon_ВидыНоминальныхОбъектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>НоминальныеОбъекты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НоминальныйОбъект</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.bon_НоминальныеОбъекты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.bon_ХарактеристикиБонусов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПереносимНа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.bon_НоминальныеОбъекты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/InformationRegisters/bon_СостоянияНоминальныхОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>bon_СостоянияНоминальныхОбъектов</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.bon_СтатусыНоминальныхОбъектов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НоминальныйОбъект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.bon_НоминальныеОбъекты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/bon_СтатусыНоминальныхОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>bon_СтатусыНоминальныхОбъектов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВведенВОборот</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыведенИзОборота</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Documents/bon_ВыводИзОборотаНоминальныхОбъектов/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
		
	// регистр ма_СостоянияНоминальныхОбъектов
	Движения.bon_СостоянияНоминальныхОбъектов.Записывать = Истина;
	Движения.bon_СостоянияНоминальныхОбъектов.Очистить();
	
	Для Каждого ТекСтрокаНоминальныеОбъекты Из НоминальныеОбъекты Цикл	
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	bon_СостоянияНоминальныхОбъектов.НоминальныйОбъект КАК НоминальныйОбъект,
		               |	bon_СостоянияНоминальныхОбъектов.Номер КАК Номер
		               |ИЗ
		               |	РегистрСведений.bon_СостоянияНоминальныхОбъектов КАК bon_СостоянияНоминальныхОбъектов
		               |ГДЕ
		               |	bon_СостоянияНоминальныхОбъектов.НоминальныйОбъект = &НоминальныйОбъект
		               |	И bon_СостоянияНоминальныхОбъектов.Статус = &Статус";
		Запрос.УстановитьПараметр("НоминальныйОбъект", ТекСтрокаНоминальныеОбъекты.НоминальныйОбъект); 
		Запрос.УстановитьПараметр("Статус", Перечисления.bon_СтатусыНоминальныхОбъектов.ВведенВОборот); 
		
		Рез = Запрос.Выполнить().Выгрузить();
		
		Если Рез.Количество() > 0 тогда
			Для Каждого Строка Из Рез Цикл 
				Движение = Движения.bon_СостоянияНоминальныхОбъектов.Добавить();
				
				Движение.Период 				= Дата;
				Движение.НоминальныйОбъект 		= Строка.НоминальныйОбъект;
				Движение.Статус 				= Перечисления.bon_СтатусыНоминальныхОбъектов.ВыведенИзОборота;
				Движение.Номер 					= Строка.Номер;
			КонецЦикла;			
		КонецЕсли;

	КонецЦикла;
	
	/////Сделать списание бонусов с сертификатов
	//Если НЕ ВидНоминальныхОбъектов.НакапливаемыйНоминал Тогда	
	//	// получим остаток и спишем его
	//	Движения.bon_ПартииБонусовНаСчетах.Записывать = Истина;
	//	Движения.bon_ПартииБонусовНаСчетах.Очистить();
	//	
	//	Запрос = Новый Запрос;
	//	Запрос.Текст = 
	//		"ВЫБРАТЬ
	//		|	bon_ПартииБонусовНаСчетахОстатки.НоминальныйОбъект,
	//		|	bon_ПартииБонусовНаСчетахОстатки.НоминалОстаток
	//		|ИЗ
	//		|	РегистрНакопления.ма_ОстаткиНоминальныхОбъектов.Остатки(&Период, НоминальныйОбъект В (&НоминальныеОбъекты)) КАК ма_ОстаткиНоминальныхОбъектовОстатки";

	//	Запрос.УстановитьПараметр("НоминальныеОбъекты", НоминальныеОбъекты.Выгрузить());
	//	Запрос.УстановитьПараметр("Период", МоментВремени());
	//	ВыборкаОстатки = Запрос.Выполнить().Выбрать();
	//	Пока ВыборкаОстатки.Следующий() Цикл
	//		Движение = Движения.ма_ОстаткиНоминальныхОбъектов.Добавить();
	//		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	//		Движение.Период 			= Дата;
	//		Движение.НоминальныйОбъект 	= ВыборкаОстатки.НоминальныйОбъект;
	//		Движение.Номинал 			= ВыборкаОстатки.НоминалОстаток;
	//	КонецЦикла;
	//КонецЕсли;
	
	Если ВидНоминальныхОбъектов.Наименование = Строка("Акционные Сертификаты") Тогда
		bon_БонуснаяПрограммаСервер.ВыводИзОборотовСертификатов(ЭтотОбъект, НоминальныеОбъекты);	
	КонецЕсли;	
		
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ); 	
КонецПроцедуры
